{
  "Dwarf": {
    "Ability score increase": [
      0,
      0,
      2,
      0,
      0,
      0
    ],
    "Description": "Dwarves are short, stocky, and sturdy. They are known for their resilience and their love of stone and metal. Dwarves are also known for their love of ale, mead, and good food. They are",
    "Speed": 25,
    "Traits": [
      "Darkvision: Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
      "Dwarven Resilience: You have advantage on saving throws against poison, and you have resistance against poison damage.",
      "Dwarven Combat Training: You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.",
      "Tool Proficiency: You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.",
      "Strong: Heavy armour does not reduce your speed.",
      "Stonecunning: Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.",
      "Languages:You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
    ],
    "Proficiencies": {
      "Armor": [],
      "Weapons": ["Battleaxe", "Handaxe", "Light hammer", "Warhammer"],
      "Tools": [],
      "Saving throws": [],
      "SkillOptions": []
    },
    "Subcraces": [
     {
       "Hill Dwarf": {
         "Ability score increase": [
           0,
           0,
           0,
           1,
           0,
           0
         ],
         "Description": "Hill dwarves are stout and hardy, with a strong sense of tradition and a belief in the benefits of a well-ordered society. They tend to be on the good side of the law, and they value loyalty and hard work. Hill dwarves are short, stocky, and hardy, with a broad, squat build. They stand between 4 and 4½ feet tall and average about 150 pounds. Hill dwarves have broad faces, prominent noses, and thick, bushy beards. Their skin ranges from pale to deep brown, and their hair is usually black, brown, or dark gray. Hill dwarves typically wear simple, practical clothing, and they favor sturdy leather boots and work gloves. They are often seen wearing studded leather armor, and they wield battleaxes, handaxes, light hammers, and warhammers.",
         "Traits": ["Ability Score Increase: Your Wisdom score increases by 1.", "Dwarven Toughness: Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."],
         "Proficiencies": {
           "Armor": [],
           "Weapons": [],
           "Tools": [],
           "Saving throws": [],
           "SkillOptions": [""]
         }
       }
     },
     {
       "Mountain Dwarf": {
         "Ability score increase": [
           2,
           0,
           0,
           0,
           0,
           0
         ],
         "Description": "Mountain dwarves are strong, hardy, and tough, with a penchant for the military life. They tend to be on the lawful side of the law, and they value honor and tradition. Mountain dwarves are short, stocky, and hardy, with a broad, squat build. They stand between 4 and 4½ feet tall and average about 150 pounds. Mountain dwarves have broad faces, prominent noses, and thick, bushy beards. Their skin ranges from pale to deep brown, and their hair is usually black, brown, or dark gray. Mountain dwarves typically wear simple, practical clothing, and they favor sturdy leather boots and work gloves. They are often seen wearing studded leather armor, and they wield battleaxes, handaxes, light hammers, and warhammers.",
         "Traits": ["Ability Score Increase: Your Strength score increases by 2.", "Dwarven Armor Training: You have proficiency with light and medium armor."],

         "Proficiencies": {
           "Armor": ["Light armor", "Medium armor"],
           "Weapons": [],
           "Tools": [],
           "Saving throws": [],
           "SkillOptions": []
         }
       }
     }
    ]
 },

  "Elf": {
    "Ability score increase": [
      0,
      2,
      0,
      0,
      0,
      0
    ],
    "Speed": 30,
    "Description": "Elves are a magical people of otherworldly grace, living in places of ethereal beauty, in the midst of ancient forests or in silvery spires glittering with faerie light, where soft music drifts through the air and gentle fragrances waft on the breeze. Elves love nature and magic, art and artistry, music and poetry.",
    "Traits": [
          "Darkvision: Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Keen Senses: You have proficiency in the Perception skill.",
          "Fey Ancestry: You have advantage on saving throws against being charmed, and magic can’t put you to sleep.",
          "Trance: Elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
          "Elf Weapon Training: You have proficiency with the longsword, shortsword, shortbow, and longbow.",
          "Languages: You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among"
      ],
    "Proficiencies": {
      "Armor": [],
      "Weapons": ["Longsword", "Shortsword", "Shortbow", "Longbow"],
      "Tools": [],
      "Saving throws": [],
      "SkillOptions": ["Perception"]
    },
    "Subraces": [
      {
        "High Elf": {
          "Ability score increase": [
            0,
            0,
            0,
            0,
            1,
            0
          ],
          "Description": "As a high elf, you have a Keen Mind and a mastery of at least The Basics of magic. In many fantasy gaming worlds, there are two kinds of high elves. One type is haughty and reclusive, believing themselves to be superior to non-elves and even other elves. The other type is more Common and more friendly, and often encountered among Humans and Other Races.",
          "Traits": [
            "Ability Score Increase: Your Intelligence score increases by 1.",
            "Cantrip: You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it.",
            "Extra Language: You can speak, read, and write one extra language of your choice.",
            "Elf Weapon Training: You have proficiency with the longsword, shortsword, shortbow, and longbow."
          ],
          "Proficiencies": [
            "Longsword",
            "Shortsword",
            "Shortbow",
            "Longbow"
          ]
        }
      },
      {
        "Wood Elf": {
          "Ability score increase": [
            0,
            0,
            0,
            1,
            0,
            0
          ],
          "Description": "As a wood elf, you have keen senses and intuition, and your fleet feet carry you quickly and stealthily through your native forests. This category includes the wild elves (grugach) of Greyhawk and the Kagonesti of Dragonlance, as well as the races called wood elves in Greyhawk and the Forgotten Realms. In Faerûn, wood elves (also called wild elves, green elves, or forest elves) are reclusive and distrusting of non-elves.\n\n",
          "Traits": [
            "Ability Score Increase: Your Wisdom score increases by 1.",
            "Fleet of Foot: Your base walking speed increases to 35 feet.",
            "Mask of the Wild: You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
          ],
          "Proficiencies": {
            "Armor": [],
            "Weapons": [],
            "Tools": [],
            "Saving throws": [],
            "SkillOptions": []
          }
        }
      }
    ]
  },

  "Halfling": {
    "Ability score increase": [0, 2, 0, 0, 0, 0],
    "Speed": 25,
    "Desciption": "The comforts of home are the goals of most halflings' lives: a place to settle in peace and quiet, far from marauding monsters and clashing armies. Others form nomadic bands that travel constantly, lured by the open road and the wide horizon to discover the wonders of new lands and peoples. Halflings work readily with others, and they are loyal to their friends, whether halfling or otherwise. They can display remarkable ferocity when their friends, families, or communities are threatened.\n\n",
    "Traits": [
      "Lucky: When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.",
      "Brave: You have advantage on saving throws against being frightened.",
      "Halfling Nimbleness: You can move through the space of any creature that is of a size larger than yours.",
      "Languages: You can speak, read, and write Common and Halfling."
    ],
    "Proficiencies": {
      "Armor": [],
      "Weapons": [],
      "Tools": [],
      "Saving throws": [],
      "SkillOptions": []
    },
    "Subraces":[
      {
        "Lightfoot": {
            "Ability score increase": [
                0,
                0,
                0,
                0,
                0,
                1
            ],
            "Description": "As a lightfoot halfling, you can easily hide from notice, even using other people as cover. You’re inclined to be affable and get along well with others. In the Forgotten Realms, lightfoot halflings have spread the farthest and thus are the most common variety.\n\nLightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life. In the world of Greyhawk, these halflings are called hairfeet or tallfellows.",
            "Traits": [
                "Ability Score Increase: Your Charisma score increases by 1.",
                "Naturally Stealthy: You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."
            ],
            "Proficiencies": {
                "Armor": [],
                "Weapons": [],
                "Tools": [],
                "Saving throws": [],
                "SkillOptions": []
            }
        }
      },
      {
        "Stout": {
            "Ability score increase": [
                0,
                0,
                1,
                0,
                0,
                0
            ],
            "Description": "As a stout halfling, you’re hardier than average and have some resistance to poison. Some say that stouts have dwarven blood. In the Forgotten Realms, these halflings are called stronghearts, and they’re most common in the south.\n\n",
            "Traits": [
                "Ability Score Increase: Your Constitution score increases by 1.",
                "Stout Resilience: You have advantage on saving throws against poison, and you have resistance against poison damage."
            ],
            "Proficiencies": {
                "Armor": [],
                "Weapons": [],
                "Tools": [],
                "Saving throws": [],
                "SkillOptions": []
            }
        }
      }
    ]
  },

  "Human": {
    "Ability score increase": [1, 1, 1, 1, 1, 1],
    "Speed": 30,
    "Description": "Humans are the most adaptable and ambitious people among the common",
    "Traits": ["Ability Score Increase: Your ability scores each increase by 1."],
    "Proficiencies": {
        "Armor": [],
        "Weapons": [],
        "Tools": [],
        "Saving throws": [],
        "SkillOptions": []
        },
    "Subraces": []
    },

   "Dragonborn": {
      "Ability score increase": [2, 0, 0, 0, 0, 1],
      "Speed": 30,
      "Description": "Dragonborn look very much like dragons standing erect in humanoid form, though they lack wings or a tail. Most dragonborn are good, but a few are evil. Those who are good are often noble, valiant, and selfless, while those who are evil can be cruel, brutal, and tyrannical. Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.",
      "Traits": [
        "Ability Score Increase: Your Strength score increases by 2, and your Charisma score increases by 1.",
        "Draconic Ancestry: You have draconic ancestry. Choose one type of tyoe of dragon. Your breath weapon and damage resistance are determined by the dragon type ",
        "Breath Weapon: You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation. When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level. After you use your breath weapon, you can't use it again until you complete a short or long rest.",
        "Damage Resistance: You have resistance to the damage type associated with your draconic ancestry."
      ],
      "Proficiencies": {
          "Armor": [],
          "Weapons": [],
          "Tools": [],
          "Saving throws": [],
          "SkillOptions": []
      },
     "Subraces": []
  },
  "Gnome": {
    "Gnome Traits": {
      "content": [
        "Your gnome character has certain characteristics in common with all other gnomes.",
        "***Ability Score Increase.*** Your Intelligence score increases by 2.",
        "***Age.*** Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.",
        "***Alignment.*** Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious.",
        "***Size.*** Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small.",
        "***Speed.*** Your base walking speed is 25 feet.",
        "***Darkvision.*** Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
        "***Gnome Cunning.*** You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.",
        "***Languages.*** You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world."
      ],
      "Rock Gnome": {
        "content": [
          "As a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes.",
          "***Ability Score Increase.*** Your Constitution score increases by 1.",
          "***Artificer’s Lore.*** Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply.",
          "***Tinker.*** You have proficiency with artisan’s tools (tinker’s tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.",
          "When you create a device, choose one of the following options:",
          [
            "*Clockwork Toy.* This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.",
            "*Fire Starter.* The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.",
            "*Music Box.* When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song’s end or when it is closed."
          ]
        ]
      }
    }
  },
  "Half-Elf": {
    "Half-Elf Traits": {
      "content": [
        "Your half-elf character has some qualities in common with elves and some that are unique to half-elves.",
        "***Ability Score Increase.*** Your Charisma score increases by 2, and two other ability scores of your choice increase by 1.",
        "***Age.*** Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years.",
        "***Alignment.*** Half-elves share the chaotic bent of their elven heritage. They value both personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others’ demands, and sometimes prove unreliable, or at least unpredictable.",
        "***Size.*** Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium.",
        "***Speed.*** Your base walking speed is 30 feet.",
        "***Darkvision.*** Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
        "***Fey Ancestry.*** You have advantage on saving throws against being charmed, and magic can’t put you to sleep.",
        "***Skill Versatility.*** You gain proficiency in two skills of your choice.",
        "***Languages.*** You can speak, read, and write Common, Elvish, and one extra language of your choice."
      ]
    }
  },
  "Half-Orc": {
    "Half-Orc Traits": {
      "content": [
        "Your half-orc character has certain traits deriving from your orc ancestry.",
        "***Ability Score Increase.*** Your Strength score increases by 2, and your Constitution score increases by 1.",
        "***Age.*** Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.",
        "***Alignment.*** Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil.",
        "***Size.*** Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium.",
        "***Speed.*** Your base walking speed is 30 feet.",
        "***Darkvision.*** Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
        "***Menacing.*** You gain proficiency in the Intimidation skill.",
        "***Relentless Endurance.*** When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest.",
        "***Savage Attacks.*** When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit.",
        "***Languages.*** You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script."
      ]
    }
  },
  "Tiefling": {
    "Tiefling Traits": {
      "content": [
        "Tieflings share certain racial traits as a result of their infernal descent.",
        "***Ability Score Increase.*** Your Intelligence score increases by 1, and your Charisma score increases by 2.",
        "***Age.*** Tieflings mature at the same rate as humans but live a few years longer.",
        "***Alignment.*** Tieflings might not have an innate tendency toward evil, but many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment.",
        "***Size.*** Tieflings are about the same size and build as humans. Your size is Medium.",
        "***Speed.*** Your base walking speed is 30 feet.",
        "***Darkvision.*** Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
        "***Hellish Resistance.*** You have resistance to fire damage.",
        "***Infernal Legacy.*** You know the *thaumaturgy* cantrip. When you reach 3rd level, you can cast the *hellish rebuke* spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the *darkness* spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells.",
        "***Languages.*** You can speak, read, and write Common and Infernal."
      ]
    }
  }
}